package org.example.algorithmGraphInWidth;

class StackX
{
    private final int SIZE = 20;
    private int[] st;
    private int top;
    // -----------------------------------------------------------
    public StackX() // Конструктор
    {
        st = new int[SIZE]; // Создание массива
        top = -1;
    }
    A
            B
    D
            C
    E
    Рис. 13.8. Граф, используемый
    в программах dfs.java и bfs.java
    Обход 589
    // -----------------------------------------------------------
    public void push(int j) // Размещение элемента в стеке
    { st[++top] = j; }
    // -----------------------------------------------------------
    public int pop() // Извлечение элемента из стека
    { return st[top--]; }
    // ------------------------------------------------------------
    public int peek() // Чтение с вершины стека
    { return st[top]; }
    // ------------------------------------------------------------
    public boolean isEmpty() // true, если стек пуст
    { return (top == -1); }
// ------------------------------------------------------------
} // Конец класса StackX
////////////////////////////////////////////////////////////////
